---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.Asset
source: html/a4771475-8e1c-3a28-c7f4-49a19df4e2d1.htm
---
# Asset Members

Adds a new connected asset attached to this asset property, if it allows it.